Revit 2026 API

# PartMakerMethodToDivideVolumes Methods

---

The PartMakerMethodToDivideVolumes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddIntersectingReference | Adds intersecting reference with an offset. |
|  | AreElementsValidIntersectingReferences(ICollectionElementId) |  |
|  | AreElementsValidIntersectingReferences(Document, ICollectionElementId) |  |
|  | CanBeDivisionProfile(ElementId) | Checks whether a family defines a profile which can be used by this method. |
|  | CanBeDivisionProfile(ElementId, Document) | Checks whether a family defines a profile which can be used by this method. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOffsetForIntersectingReference | Gets offset for the intersecting reference. |
|  | GetPlaneOfSketch | Gets the plane of the sketch. |
|  | GetSketchCurves |  |
|  | GetSplitRefsOffsets | Returns offsets for plane-defining splitters. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsElementValidIntersectingReference(ElementId) | Identifies if the provided member is valid. |
|  | IsElementValidIntersectingReference(Document, ElementId) | Identifies if the provided member is valid. |
|  | IsValidSketchPlane | Identifies if provided sketch plane is valid. |
|  | RemoveIntersectingReference | Removed intersecting reference. |
|  | SetOffsetForIntersectingReference | Sets offset for the intersecting reference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UsesReference | Identifies if the PartMaker uses the intersecting reference. |

#### Reference

PartMakerMethodToDivideVolumes Class

Autodesk.Revit.DB Namespace